# Pandas_4

In [1]:
#Import The Libriary 
import pandas as pd

In [2]:
#Read The Csv File
df = pd.read_csv('data23.csv')

In [3]:
#Print The Data Frame
df

  tickers            eps  revenue price          people
0   GOOGL          27.83       87    845    larry  page
1     WMT           4.61      484     65           n.a.
2    MSFT             -1       85     64     bill gates
3     RIL  not available       50   1023  mukesh ambani
4    TATA            5.6       -1   n.a.     ratan tata

In [4]:
#Read The Csv File
df1 = pd.read_csv('data23.csv', header=None)

In [5]:
#Print The Data Frame
df1

         0              1        2       3              4
0  tickers            eps  revenue  price          people
1    GOOGL          27.83       87     845    larry  page
2      WMT           4.61      484      65           n.a.
3     MSFT             -1       85      64     bill gates
4      RIL  not available       50    1023  mukesh ambani
5     TATA            5.6       -1    n.a.     ratan tata

In [6]:
#Read The Csv File
df2 = pd.read_csv('data23.csv',header=None,names=['t','v','y','x'])

In [7]:
#Print The Data Frame
df2

                     t        v       y              x
tickers            eps  revenue  price          people
GOOGL            27.83       87     845    larry  page
WMT               4.61      484      65           n.a.
MSFT                -1       85      64     bill gates
RIL      not available       50    1023  mukesh ambani
TATA               5.6       -1    n.a.     ratan tata

In [9]:
#Read The Csv File
df2 = pd.read_csv('data23.csv',nrows =3)

In [10]:
#Print The Data Frame
df2

  tickers    eps  revenue  price        people
0   GOOGL  27.83       87     845  larry  page
1     WMT   4.61      484      65         n.a.
2    MSFT  -1.00       85      64   bill gates

In [17]:
#Read The Csv File
df3 = pd.read_csv('data23.csv', na_values = {
    'eps':['not available' ,'n.a.'],
    'revenue':['not available' ,'n.a.',-1],
    'people':['not available' ,'n.a.']
})

In [18]:
#Print The Data Frame
df3

  tickers    eps  revenue price          people
0   GOOGL  27.83     87.0    845    larry  page
1     WMT   4.61    484.0     65            NaN
2    MSFT  -1.00     85.0     64     bill gates
3     RIL    NaN     50.0   1023  mukesh ambani
4    TATA   5.60      NaN   n.a.     ratan tata

In [19]:
#Create The File And Save
df3.to_csv('new.csv')

In [20]:
#Feature Are Show
df3.columns

Index(['tickers', 'eps', 'revenue', 'price ', 'people'], dtype='object')

In [21]:
#Create The Function And Save  repalce the value
def convert_people_convert(cell):
    if cell == 'n.a.':
        return 'sam walton'
    return cell
def convert_eps_convert(cell):
    if cell == 'not available':
        return None
    return cell
df4 = pd.read_excel('data234.xlsx','Sheet1',converters ={
    'people ':convert_people_convert,
    'eps':convert_eps_convert
})

In [25]:
#Save The File 
df4.to_excel('data2346.xlsx',sheet_name = 'stocks',startrow = 1,startcol =2,index = False)

In [27]:
#Create The Data Frame add The Data 
df_stocks = pd.DataFrame({
    'tickers':['GOOGL','WMT','MSFT
               '],
    'price':[185,65,45],
    'pe':[30.1,23.5,456.0,],
    'eps':[27.2,56.3,85.2]
    
})

df_weather = pd.DataFrame({
    
    'day':['1/1/2023','5/9/2023/','8/9/2001'],
    'temperature':[32,52,45],
    'event':['Rain','Sunny','Snow']
})

In [32]:
#Create The File and Save Sheet One And Sheet two 
with pd.ExcelWriter('stocks_weather.xlsx') as writer:
    df_stocks.to_excel(writer,sheet_name =  'stocks')
    df_weather.to_excel(writer,sheet_name ='weather')